src/main/resources/request.xml

<?xml version="1.0" encoding="UTF-8"?>

<soapenv:Envelope
    xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
    xmlns:ban="http://esmt.banque">
    <soapenv:Header/>
    <soapenv:Body>
        <ban:getClientInfoRequest>
            <ban:numeroTel>777777777</ban:numeroTel>
        </ban:getClientInfoRequest>
    </soapenv:Body>
</soapenv:Envelope>